## Plan Result (sbox-05-mis)




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_role_assignment.global_registry_acrpull




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_role_assignment.global_registry_acrpull will be created
  + resource "azurerm_role_assignment" "global_registry_acrpull" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "fd657beb-8e34-42f2-9cc7-f9016a065849"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "AcrPull"
      + scope                            = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/rpe-acr-prod-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":248,"Program":"tfcmt","SHA1":"","Target":"sbox-05-mis","Vars":{}} -->